<?php
class controllers_ApiController extends MainController{
    public function listAction(){
        $data['api_list'] = array(
            0 => array(
                'title' => 'Վճարային համակարգ',
                'description' => 'Վճարային համակարգ API – Նկարագրություն
                    <br>
                    Վճարային համակարգի API-ն նախատեսված է ինտեգրման համար տարբեր վեբ և բջջային հարթակներում, որոնք պահանջում են ապահով և ճկուն վճարումների իրականացում։ Այն ապահովում է ինչպես օնլայն փոխանցումներ, այնպես էլ ներքին հաշվարկներ՝ տրամադրելով պարզ, բայց հզոր ինտերֆեյս։            
                    <br>
                    Այս API-ի միջոցով ծրագրավորողները կարող են իրենց հավելվածներում իրականացնել․
                    <br>
                    💳 Քարտային վճարումներ (Visa, MasterCard, AMEX և այլն)
                    <br>
                    🏦 Բանկային փոխանցումներ
                    <br>
                    📲 Էլեկտրոնային դրամապանակների (e-wallet) վճարումներ
                    <br>
                    🔄 Վերադարձներ և չեղարկումներ (refunds & cancellations)
                    <br>
                    📑 Վճարման պատմության մոնիթորինգ և հաշվետվություններ
                    <br>
                    API-ն կառուցված է RESTful ճարտարապետությամբ, իսկ բոլոր հարցումները և պատասխանները փոխանցվում են JSON ձևաչափով։ Բոլոր endpoint-երը ապահովված են HTTPS–ով և պահանջում են JWT (JSON Web Token) authentication։
                '
            ),
            1 => array(
                'title' => 'Եղանակի տեսություն',
                'description' => 'Եղանակի տեսություն API – Նկարագրություն
                    Եղանակի տեսության API-ն նախատեսված է ծրագրավորողների համար, ովքեր ցանկանում են իրենց վեբ կամ բջջային հավելվածներում ապահովել իրական ժամանակի եղանակային տվյալների և կանխատեսումների ցուցադրում։ Այն հնարավորություն է տալիս օգտատերերին ստանալ տեղային եղանակի պայմաններ, բազմօրյա կանխատեսումներ, մթնոլորտային տվյալներ, ինչպես նաև ծանուցումներ եղանակային վտանգավոր երևույթների մասին։
                    <br>
                    API-ն կառուցված է RESTful ճարտարապետությամբ։ Հարցումները և պատասխանները փոխանցվում են JSON ձևաչափով։ Տվյալները թարմացվում են իրական ժամանակում՝ հիմնվելով գլոբալ եղանակային մոդելների և տեղական մոնիթորինգային կայանների վրա։
                '
            ),
            2 => array(
                'title' => 'Համերգի տոմսերի վաճառք',
                'description' => 'Համերգի տոմսերի վաճառք API – Նկարագրություն 🎫🎶
                    <br>
                    Համերգի տոմսերի վաճառքի API-ն նախատեսված է միջոցառումների կազմակերպիչների և առցանց տոմսերի վաճառքի հարթակների համար։ Այն ապահովում է տոմսերի օնլայն վաճառք, ամրագրում, QR/բարկոդ գեներացում և մուտքի վերահսկում։
                    <br>
                    API-ն կառուցված է RESTful ճարտարապետությամբ, բոլոր հարցումները և պատասխանները փոխանցվում են JSON ձևաչափով։ Մուտքն ապահովվում է OAuth 2.0 կամ JWT token–ներով։
                '
            ),
            3 => array(
                'title' => 'Ռեստորանում սեղանի ամրագրում',
                'description' => 'Ռեստորանի սեղանի ամրագրում API – Նկարագրություն 🍽️📱
                    <br>
                    Ռեստորանի սեղանի ամրագրում API-ն նախատեսված է ռեստորանների և առցանց ամրագրումների հարթակների համար։ Այն ապահովում է սեղանների առցանց որոնում, ամրագրում, չեղարկում և օգտատիրոջ ծանուցում։
                    <br>
                    API-ն կառուցված է RESTful ճարտարապետությամբ, հաղորդակցությունը կատարվում է JSON ձևաչափով։ Մուտքն իրականացվում է JWT կամ OAuth 2.0 token–ներով։
                '
            ),
            4 => array(
                'title' => 'Ավիատոմսերի վաճառք',
                'description' => 'Ավիատոմսերի վաճառք API ✈️
                    <br>
                    Ավիատոմսերի վաճառք API-ն նախատեսված է ավիաընկերությունների, տուրիստական գործակալությունների և առցանց բուկինգ հարթակների համար։ Այն ապահովում է թռիչքների որոնում, գների համեմատում, տոմսերի ամրագրում և գնում, ինչպես նաև ուղևորների տվյալների կառավարում։
                    <br>
                    API-ն կառուցված է RESTful սկզբունքներով, տվյալների փոխանցումը հիմնականում կատարվում է JSON ձևաչափով։ Նավիգացիան ապահովվում է OAuth 2.0 / JWT հիման վրա։
                '
            ),
        );
        $this->render('api/list',$data);
    }

    public function viewAction(){
        $data['team_members'] = array(
            0 => array(
                'id' => 1,
                'full_name' => "Արման Խաչատրյան",
                'color' => 'green'
            ),
            1 => array(
                'id' => 2,
                'full_name' => 'Դավիթ Բեկնազարյան',
                'color' => 'red'
            ),
            2 => array(
                'id' => 3,
                'full_name' => 'Զառա Խանամիրյան',
                'color' => 'blue'
            ),
            3 => array(
                'id' => 4,
                'full_name' => 'Աշոտ Գևորգյան',
                'color' => 'gray'
            ),
            4 => array(
                'id' => 5,
                'full_name' => 'Կարեն Գևորգյան',
                'color' => 'magenta'
            ),
            5 => array(
                'id' => 1,
                'full_name' => 'Արման Խաչատրյան',
                'color' => 'green'
            ),
            6 => array(
                'id' => 2,
                'full_name' => 'Դավիթ Բեկնազարյան',
                'color' => 'red'
            ),
            7 => array(
                'id' => 3,
                'full_name' => 'Զառա Խանամիրյան',
                'color' => 'blue'
            ),
            8 => array(
                'id' => 4,
                'full_name' => 'Աշոտ Գևորգյան',
                'color' => 'gray'
            ),
            9 => array(
                'id' => 5,
                'full_name' => 'Կարեն Գևորգյան',
                'color' => 'magenta'
            )
        );

        $data['messages'] = array(
            0 => array(
                'message_id' => 1,
                'writer_id' => 3,
                'writer_full_name' => 'Զառա Խանամիրյան',
                'color' => 'blue',
                'message' => 'Բարև Ձեզ։
                              Խնդրեմ ասեք ինչ փուլում են գտնվում աշխատանքները և հնարավորության դեպքում տրամադրեք վերջնաժամկետ։'
            ),
            1 => array(
                'message_id' => 2,
                'writer_id' => 2,
                'writer_full_name' => 'Դավիթ Բեկնազարյան',
                'color' => 'red',
                'message' => 'Բարև։
                              Հիմա գտնվում ենք թեստավորման փուլում, բայց թիմի ղեկավարի առաջարկով, առաջացել են որոշակի փոփոխությունների կարիք։'
            ),
            2 => array(
                'message_id' => 3,
                'writer_id' => 2,
                'writer_full_name' => 'Դավիթ Բեկնազարյան',
                'color' => 'red',
                'message' => 'Խնդրեմ ծրագրավորողներին նշել իրենց փոփոխության վերջնաժամկետ, ըստ այդմ հասկանանք։'
            ),
            3 => array(
                'message_id' => 4,
                'writer_id' => 5,
                'writer_full_name' => 'Կարեն Գևորգյան',
                'color' => 'magenta',
                'message' => 'Բարև բոլորին, փոփոխությունները շաբաթվա վերջ արված կլինեն։'
            ),
            4 => array(
                'message_id' => 5,
                'writer_id' => 2,
                'writer_full_name' => 'Դավիթ Բեկնազարյան',
                'color' => 'red',
                'message' => 'Շատ լավ, կարծում եմ մյուս շաբաթվա հաջորդող շաբաթվա սկիզբ պատրաստ կլինենք հրապարակման։'
            ),
            5 => array(
                'message_id' => 6,
                'writer_id' => 3,
                'writer_full_name' => 'Զառա Խանամիրյան',
                'color' => 'blue',
                'message' => 'Լավ'
            )
        );

        $this->render('api/view',$data);
    }

    public function detailsAction(){

        $this->render('api/details');
    }

    public function formAction(){
        $this->render('api/form');
    }
}